Revit 2024 API
IFCLegacyStairOrRamp.GetNumberOfRisers Method
 Gets the number of risers.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<int> GetNumberOfRisers()
Visual Basic
Public Function GetNumberOfRisers As IList(Of Integer)
Visual C++
public:
IList<int>^ GetNumberOfRisers()
Return Value
 The list of numbers of risers.
See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace